# Ch03.4 DataFrame Indexing and Selection

## Data Selection in DataFrame

### DataFrame as a dictionary

In [2]:
import numpy as np
import pandas as pd

In [3]:
pd.__version__

'1.5.0'

In [4]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [5]:
data['area'] #dictionary-style indexing

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [6]:
data.area #attribute-style access

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

This attribute-style column access actually accesses the exact same object as the dictionary-style access:

In [7]:
data.area is data['area']

True

In [9]:
data.pop() # dataframe 有一個 pop 的 function

TypeError: DataFrame.pop() missing 1 required positional argument: 'item'

the ``DataFrame`` has a ``pop()`` method, so ``data.pop`` will point to this rather than the ``"pop"`` column:

In [10]:
data.pop is data['pop']

False

adding a new column:

In [11]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

### DataFrame as two-dimensional array

In [15]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [12]:
data.columns

Index(['area', 'pop', 'density'], dtype='object')

In [13]:
data.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [14]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

transpose the full ``DataFrame`` to swap rows and columns:

In [19]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

passing a single index to an array accesses a row:

In [12]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

passing a single "index" to a ``DataFrame`` accesses a column:

In [20]:
# 結果為 Series
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

acess mutiple columns

In [21]:
# fancy index 結果為Data frame
data[['area','pop']]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [22]:
data[['pop']]

                 pop
California  38332521
Texas       26448193
New York    19651127
Florida     19552860
Illinois    12882135

In [23]:
data[['pop']].shape

(5, 1)

In [28]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [27]:
# 抓第0筆資料
data[:1]

              area       pop    density
California  423967  38332521  90.413926

In [29]:
# 抓前三筆資料
data[:3]

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746

In [16]:
data[0:3]

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746

In [31]:
# masking
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

In [30]:
# 多條件masking
data[(data['pop'] > 20000000) & (data['area'] > 50000)]

              area       pop    density
California  423967  38332521  90.413926
Texas       695662  26448193  38.018740

Using the iloc indexer, the ``DataFrame`` index and column labels are maintained in the result:

In [19]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [37]:
# 1 rows, 2 colume
data.iloc[1,2]

38.01874042279153

In [35]:
# 相當於data.iloc[0,:]
data.iloc[0]

area       4.239670e+05
pop        3.833252e+07
density    9.041393e+01
Name: California, dtype: float64

In [44]:
## slicing > fancy > masking
data.iloc[0:1]

              area       pop    density
California  423967  38332521  90.413926

In [45]:
%timeit data.iloc[0:1]

7.44 µs ± 34.7 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [41]:
data.iloc[[0]]

              area       pop    density
California  423967  38332521  90.413926

In [46]:
%timeit data.iloc[[0]]

59.7 µs ± 335 ns per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

In [47]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [48]:
# 因為是 slicing 所以是dataframe
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

Using the ``loc`` indexer we can index the underlying data using the explicit index and column names:

In [23]:
data.loc['Texas']

area       6.956620e+05
pop        2.644819e+07
density    3.801874e+01
Name: Texas, dtype: float64

In [24]:
data.loc['Illinois', 'pop']

12882135

In [25]:
data.loc[:'Texas', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193

combine masking and fancy indexing as in the following:

In [49]:
# masking + fancy
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [51]:
%timeit data.loc[data.density > 100, ['pop', 'density']]

409 µs ± 3.33 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [50]:
# masking + slicing
data.loc[data.density > 100, 'pop':'density']

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [52]:
%timeit data.loc[data.density > 100, 'pop':'density']

274 µs ± 3 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

to set or modify values

In [28]:
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

### Additional indexing conventions

In [57]:
# dtaframe 預設以欄為主，index 預設抓欄位
data["Florida"]

KeyError: 'Florida'

In [59]:
data["area"]

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [63]:
data.loc[:,["area"]]

              area
California  423967
Texas       695662
New York    141297
Florida     170312
Illinois    149995

In [70]:
data.loc[["Florida"]]

           area       pop     density
Florida  170312  19552860  114.806121

In [58]:
# 不建議 請使用loc or iloc
# slice 就是取得資料
data['Florida':'Illinois'] # slicing rows

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

Such slices can also refer to rows by number rather than by index:

In [30]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [76]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [71]:
data.ix["Texas", 1]

AttributeError: 'DataFrame' object has no attribute 'ix'

Similarly, direct masking operations are also interpreted row-wise rather than column-wise:

Access a single value for a row/column pair

In [74]:
data.at['Texas','area']

695662

In [80]:
%timeit data.at['Texas','area']

2.08 µs ± 12.3 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [73]:
data.loc['Texas','area']

695662

In [79]:
%timeit data.loc['Texas','area']

4.07 µs ± 13.7 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [75]:
data.iat[1,0]

695662

In [78]:
%timeit data.iat[1,0]

6.75 µs ± 21.9 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [34]:
data.iloc[1,0]

695662

In [77]:
%timeit data.iloc[1,0]

9.08 µs ± 48 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)